{
    "@odata.type":  "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "This compliance policy is for devices used by specific users or groups who are uniquely high risk (for example, users who handle highly sensitive data where unauthorized disclosure causes considerable material loss to the organization).",
    "displayName":  "Fully managed high security configuration (Level 3)",
    "accountsBlockModification":  null,
    "appsAllowInstallFromUnknownSources":  null,
    "appsAutoUpdatePolicy":  "always",
    "appsDefaultPermissionPolicy":  null,
    "appsRecommendSkippingFirstUseHints":  null,
    "bluetoothBlockConfiguration":  null,
    "bluetoothBlockContactSharing":  null,
    "cameraBlocked":  null,
    "cellularBlockWiFiTethering":  true,
    "certificateCredentialConfigurationDisabled":  true,
    "microsoftLauncherConfigurationEnabled":  null,
    "enrollmentProfile":  "notConfigured",
    "dataRoamingBlocked":  null,
    "dateTimeConfigurationBlocked":  true,
    "factoryResetDeviceAdministratorEmails":  [
                                                  "example@gmail.com"
                                              ],
    "factoryResetBlocked":  true,
    "globalProxy":  null,
    "googleAccountsBlocked":  true,
    "kioskModeScreenSaverConfigurationEnabled":  null,
    "kioskModeScreenSaverImageUrl":  null,
    "kioskModeScreenSaverDisplayTimeInSeconds":  null,
    "kioskModeScreenSaverStartDelayInSeconds":  null,
    "kioskModeScreenSaverDetectMediaDisabled":  null,
    "kioskModeWallpaperUrl":  null,
    "kioskModeExitCode":  null,
    "kioskModeVirtualHomeButtonEnabled":  null,
    "kioskModeVirtualHomeButtonType":  null,
    "kioskModeBluetoothConfigurationEnabled":  null,
    "kioskModeWiFiConfigurationEnabled":  null,
    "kioskModeFlashlightConfigurationEnabled":  null,
    "kioskModeMediaVolumeConfigurationEnabled":  null,
    "microphoneForceMute":  null,
    "networkEscapeHatchAllowed":  null,
    "nfcBlockOutgoingBeam":  true,
    "passwordBlockKeyguard":  null,
    "passwordBlockKeyguardFeatures":  [
                                          "trustAgents",
                                          "unredactedNotifications"
                                      ],
    "passwordExpirationDays":  365,
    "passwordMinimumLength":  6,
    "passwordMinimumLetterCharacters":  null,
    "passwordMinimumLowerCaseCharacters":  null,
    "passwordMinimumNonLetterCharacters":  null,
    "passwordMinimumNumericCharacters":  null,
    "passwordMinimumSymbolCharacters":  null,
    "passwordMinimumUpperCaseCharacters":  null,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordCountToBlock":  5,
    "passwordRequiredType":  "numericComplex",
    "passwordSignInFailureCountBeforeFactoryReset":  5,
    "playStoreMode":  null,
    "safeBootBlocked":  true,
    "screenCaptureBlocked":  null,
    "securityAllowDebuggingFeatures":  null,
    "securityRequireVerifyApps":  true,
    "statusBarBlocked":  null,
    "stayOnModes":  [

                    ],
    "storageAllowUsb":  null,
    "storageBlockExternalMedia":  true,
    "storageBlockUsbFileTransfer":  true,
    "systemUpdateWindowStartMinutesAfterMidnight":  null,
    "systemUpdateWindowEndMinutesAfterMidnight":  null,
    "systemUpdateInstallType":  "automatic",
    "systemWindowsBlocked":  null,
    "usersBlockAdd":  true,
    "usersBlockRemove":  true,
    "volumeBlockAdjustment":  null,
    "vpnAlwaysOnLockdownMode":  false,
    "vpnAlwaysOnPackageIdentifier":  "",
    "wifiBlockEditConfigurations":  null,
    "wifiBlockEditPolicyDefinedConfigurations":  null,
    "kioskModeApps":  [

                      ]
}
