{
    "@odata.type":  "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "This compliance policy is for devices used by specific users or groups who are uniquely high risk (for example, users who handle highly sensitive data where unauthorized disclosure causes considerable material loss to the organization).",
    "displayName":  "Fully managed high security configuration (Level 3) v1.2",
    "accountsBlockModification":  null,
    "appsAllowInstallFromUnknownSources":  null,
    "appsAutoUpdatePolicy":  "always",
    "appsDefaultPermissionPolicy":  null,
    "appsRecommendSkippingFirstUseHints":  null,
    "bluetoothBlockConfiguration":  null,
    "bluetoothBlockContactSharing":  false,
    "cameraBlocked":  null,
    "cellularBlockWiFiTethering":  true,
    "certificateCredentialConfigurationDisabled":  true,
    "crossProfilePoliciesAllowCopyPaste":  null,
    "crossProfilePoliciesAllowDataSharing":  null,
    "crossProfilePoliciesShowWorkContactsInPersonalProfile":  null,
    "microsoftLauncherConfigurationEnabled":  null,
    "microsoftLauncherCustomWallpaperEnabled":  null,
    "microsoftLauncherCustomWallpaperImageUrl":  null,
    "microsoftLauncherCustomWallpaperAllowUserModification":  null,
    "microsoftLauncherFeedEnabled":  null,
    "microsoftLauncherFeedAllowUserModification":  null,
    "microsoftLauncherDockPresenceConfiguration":  null,
    "microsoftLauncherDockPresenceAllowUserModification":  null,
    "microsoftLauncherSearchBarPlacementConfiguration":  null,
    "enrollmentProfile":  "notConfigured",
    "dataRoamingBlocked":  null,
    "dateTimeConfigurationBlocked":  true,
    "factoryResetDeviceAdministratorEmails":  [
                                                  "example@gmail.com"
                                              ],
    "factoryResetBlocked":  true,
    "globalProxy":  null,
    "googleAccountsBlocked":  true,
    "kioskCustomizationDeviceSettingsBlocked":  null,
    "kioskCustomizationPowerButtonActionsBlocked":  null,
    "kioskCustomizationStatusBar":  "notConfigured",
    "kioskCustomizationSystemErrorWarnings":  null,
    "kioskCustomizationSystemNavigation":  "notConfigured",
    "kioskModeScreenSaverConfigurationEnabled":  null,
    "kioskModeScreenSaverImageUrl":  null,
    "kioskModeScreenSaverDisplayTimeInSeconds":  null,
    "kioskModeScreenSaverStartDelayInSeconds":  null,
    "kioskModeScreenSaverDetectMediaDisabled":  null,
    "kioskModeWallpaperUrl":  null,
    "kioskModeExitCode":  null,
    "kioskModeVirtualHomeButtonEnabled":  null,
    "kioskModeVirtualHomeButtonType":  null,
    "kioskModeBluetoothConfigurationEnabled":  null,
    "kioskModeWiFiConfigurationEnabled":  null,
    "kioskModeFlashlightConfigurationEnabled":  null,
    "kioskModeMediaVolumeConfigurationEnabled":  null,
    "kioskModeShowDeviceInfo":  null,
    "kioskModeManagedSettingsEntryDisabled":  null,
    "kioskModeDebugMenuEasyAccessEnabled":  null,
    "kioskModeShowAppNotificationBadge":  null,
    "kioskModeScreenOrientation":  null,
    "kioskModeIconSize":  null,
    "kioskModeFolderIcon":  null,
    "kioskModeWifiAllowedSsids":  [

                                  ],
    "kioskModeAppOrderEnabled":  null,
    "kioskModeAppsInFolderOrderedByName":  null,
    "kioskModeGridHeight":  null,
    "kioskModeGridWidth":  null,
    "kioskModeLockHomeScreen":  null,
    "kioskModeManagedHomeScreenAutoSignout":  null,
    "kioskModeManagedHomeScreenInactiveSignOutDelayInSeconds":  null,
    "kioskModeManagedHomeScreenInactiveSignOutNoticeInSeconds":  null,
    "kioskModeManagedHomeScreenPinComplexity":  null,
    "kioskModeManagedHomeScreenPinRequired":  null,
    "kioskModeManagedHomeScreenPinRequiredToResume":  null,
    "kioskModeManagedHomeScreenSignInBackground":  null,
    "kioskModeManagedHomeScreenSignInBrandingLogo":  null,
    "kioskModeManagedHomeScreenSignInEnabled":  null,
    "microphoneForceMute":  null,
    "networkEscapeHatchAllowed":  null,
    "nfcBlockOutgoingBeam":  true,
    "passwordBlockKeyguard":  null,
    "passwordBlockKeyguardFeatures":  [
                                          "trustAgents",
                                          "unredactedNotifications"
                                      ],
    "passwordExpirationDays":  365,
    "passwordMinimumLength":  6,
    "passwordMinimumLetterCharacters":  null,
    "passwordMinimumLowerCaseCharacters":  null,
    "passwordMinimumNonLetterCharacters":  null,
    "passwordMinimumNumericCharacters":  null,
    "passwordMinimumSymbolCharacters":  null,
    "passwordMinimumUpperCaseCharacters":  null,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordCountToBlock":  5,
    "passwordRequiredType":  "numericComplex",
    "passwordSignInFailureCountBeforeFactoryReset":  5,
    "playStoreMode":  null,
    "screenCaptureBlocked":  null,
    "securityDeveloperSettingsEnabled":  null,
    "securityRequireVerifyApps":  true,
    "statusBarBlocked":  null,
    "stayOnModes":  [

                    ],
    "storageAllowUsb":  null,
    "storageBlockExternalMedia":  true,
    "storageBlockUsbFileTransfer":  true,
    "systemUpdateWindowStartMinutesAfterMidnight":  null,
    "systemUpdateWindowEndMinutesAfterMidnight":  null,
    "systemUpdateInstallType":  "automatic",
    "systemWindowsBlocked":  null,
    "usersBlockAdd":  true,
    "usersBlockRemove":  true,
    "volumeBlockAdjustment":  null,
    "vpnAlwaysOnLockdownMode":  false,
    "vpnAlwaysOnPackageIdentifier":  "",
    "wifiBlockEditConfigurations":  null,
    "wifiBlockEditPolicyDefinedConfigurations":  null,
    "personalProfileAppsAllowInstallFromUnknownSources":  null,
    "personalProfileCameraBlocked":  null,
    "personalProfileScreenCaptureBlocked":  null,
    "personalProfilePlayStoreMode":  "notConfigured",
    "workProfilePasswordExpirationDays":  365,
    "workProfilePasswordMinimumLength":  6,
    "workProfilePasswordMinimumNumericCharacters":  null,
    "workProfilePasswordMinimumNonLetterCharacters":  null,
    "workProfilePasswordMinimumLetterCharacters":  null,
    "workProfilePasswordMinimumLowerCaseCharacters":  null,
    "workProfilePasswordMinimumUpperCaseCharacters":  null,
    "workProfilePasswordMinimumSymbolCharacters":  null,
    "workProfilePasswordPreviousPasswordCountToBlock":  5,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset":  5,
    "workProfilePasswordRequiredType":  "numericComplex",
    "azureAdSharedDeviceDataClearApps":  [

                                         ],
    "kioskModeApps":  [

                      ],
    "kioskModeManagedFolders":  [

                                ],
    "kioskModeAppPositions":  [

                              ],
    "systemUpdateFreezePeriods":  [

                                  ],
    "personalProfilePersonalApplications":  [

                                            ]
}
