{
    "@odata.type":  "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "This device restriction configuration policy is the minimum security configuration for personally owned devices where users access work or school data. This configuration is applicable to most mobile users.",
    "displayName":  "Work profile basic security configuration (Level 1) v1.1",
    "passwordBlockFaceUnlock":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockIrisUnlock":  false,
    "passwordBlockTrustAgents":  false,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  6,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordSignInFailureCountBeforeFactoryReset":  10,
    "passwordRequiredType":  "numericComplex",
    "workProfileDataSharingType":  "allowPersonalToWork",
    "workProfileBlockNotificationsWhileDeviceLocked":  false,
    "workProfileBlockAddingAccounts":  true,
    "workProfileBluetoothEnableContactSharing":  true,
    "workProfileBlockScreenCapture":  true,
    "workProfileBlockCrossProfileCallerId":  false,
    "workProfileBlockCamera":  false,
    "workProfileBlockCrossProfileContactsSearch":  false,
    "workProfileBlockCrossProfileCopyPaste":  true,
    "workProfileDefaultAppPermissionPolicy":  "deviceDefault",
    "workProfilePasswordBlockFingerprintUnlock":  false,
    "workProfilePasswordBlockTrustAgents":  false,
    "workProfilePasswordExpirationDays":  null,
    "workProfilePasswordMinimumLength":  6,
    "workProfilePasswordMinNumericCharacters":  null,
    "workProfilePasswordMinNonLetterCharacters":  null,
    "workProfilePasswordMinLetterCharacters":  null,
    "workProfilePasswordMinLowerCaseCharacters":  null,
    "workProfilePasswordMinUpperCaseCharacters":  null,
    "workProfilePasswordMinSymbolCharacters":  null,
    "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout":  5,
    "workProfilePasswordPreviousPasswordBlockCount":  null,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset":  10,
    "workProfilePasswordRequiredType":  "numericComplex",
    "workProfileRequirePassword":  true,
    "securityRequireVerifyApps":  true,
    "vpnAlwaysOnPackageIdentifier":  null,
    "vpnEnableAlwaysOnLockdownMode":  false,
    "workProfileAllowWidgets":  true,
    "workProfileBlockPersonalAppInstallsFromUnknownSources":  false
}
