{
  "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
  "description": "This compliance policy is the minimum security configuration for personal devices where users access work or school data. This configuration is applicable to most mobile users.",
  "displayName": "Work profile basic security compliance (Level 1) v1.1",
  "scheduledActionsForRule":[{"ruleName":"PasswordRequired","scheduledActionConfigurations":[{"actionType":"block","gracePeriodHours":0,"notificationTemplateId":""}]}],
  "passwordRequired": true,
  "passwordMinimumLength": 6,
  "passwordRequiredType": "numericComplex",
  "passwordMinutesOfInactivityBeforeLock": 5,
  "passwordExpirationDays": null,
  "passwordPreviousPasswordBlockCount": null,
  "passwordSignInFailureCountBeforeFactoryReset": null,
  "securityPreventInstallAppsFromUnknownSources": true,
  "securityDisableUsbDebugging": true,
  "securityRequireVerifyApps": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "securityBlockJailbrokenDevices": true,
  "osMinimumVersion": "6.0",
  "osMaximumVersion": null,
  "minAndroidSecurityPatchLevel": null,
  "storageRequireEncryption": true,
  "securityRequireSafetyNetAttestationBasicIntegrity": true,
  "securityRequireSafetyNetAttestationCertifiedDevice": true,
  "securityRequireGooglePlayServices": true,
  "securityRequireUpToDateSecurityProviders": true,
  "securityRequireCompanyPortalAppIntegrity": true
}