{
    "@odata.type":  "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "This device restriction configuration policy is for devices used by specific users or groups who are uniquely high risk (for example, users who handle highly sensitive data where unauthorized disclosure causes considerable material loss to the organization).",
    "displayName":  "Work profile high security configuration (Level 3) v1.2",
    "passwordBlockFaceUnlock":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockIrisUnlock":  false,
    "passwordBlockTrustAgents":  false,
    "passwordExpirationDays":  365,
    "passwordMinimumLength":  6,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordBlockCount":  5,
    "passwordSignInFailureCountBeforeFactoryReset":  5,
    "passwordRequiredType":  "numericComplex",
    "workProfileAllowAppInstallsFromUnknownSources":  false,
    "workProfileDataSharingType":  "allowPersonalToWork",
    "workProfileBlockNotificationsWhileDeviceLocked":  true,
    "workProfileBlockAddingAccounts":  true,
    "workProfileBluetoothEnableContactSharing":  false,
    "workProfileBlockScreenCapture":  true,
    "workProfileBlockCrossProfileCallerId":  false,
    "workProfileBlockCamera":  false,
    "workProfileBlockCrossProfileContactsSearch":  true,
    "workProfileBlockCrossProfileCopyPaste":  true,
    "workProfileDefaultAppPermissionPolicy":  "deviceDefault",
    "workProfilePasswordBlockFaceUnlock":  false,
    "workProfilePasswordBlockFingerprintUnlock":  false,
    "workProfilePasswordBlockIrisUnlock":  false,
    "workProfilePasswordBlockTrustAgents":  true,
    "workProfilePasswordExpirationDays":  365,
    "workProfilePasswordMinimumLength":  6,
    "workProfilePasswordMinNumericCharacters":  null,
    "workProfilePasswordMinNonLetterCharacters":  null,
    "workProfilePasswordMinLetterCharacters":  null,
    "workProfilePasswordMinLowerCaseCharacters":  null,
    "workProfilePasswordMinUpperCaseCharacters":  null,
    "workProfilePasswordMinSymbolCharacters":  null,
    "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout":  5,
    "workProfilePasswordPreviousPasswordBlockCount":  5,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset":  5,
    "workProfilePasswordRequiredType":  "numericComplex",
    "workProfileRequirePassword":  true,
    "securityRequireVerifyApps":  true,
    "vpnAlwaysOnPackageIdentifier":  null,
    "vpnEnableAlwaysOnLockdownMode":  false,
    "workProfileAllowWidgets":  false,
    "workProfileBlockPersonalAppInstallsFromUnknownSources":  true
}
